title: xrdp reconnect
id: bf2082bc-a2b6-4997-aafd-1a9a62f96ef7
status: test
description: Detects the reconnect of xrdp session
references:
    - https://access.redhat.com/documentation/en-us/red_hat_enterprise_linux/7/html/security_guide/sec-understanding_audit_log_files
    - https://access.redhat.com/articles/4409591#audit-record-types-2
    - https://www.youtube.com/watch?v=VmvY5SQm5-Y&ab_channel=M45C07
author: Adam Liquorish
date: 2024/06/18
modified: 2024/06/18
tags:
    - attack.t1136.001
    - attack.persistence
logsource:
    product: linux
    service: syslog
detection:
    selection_xrdpsesman:
        - 'xrdp-sesman'
    selection_status:
        - 'reconnected session'
    condition: all of selection_*
falsepositives:
    - Admin activity
level: medium
