title: xrdp logon success
id: 8a7ec7cd-97a4-4fa4-99fd-8e04e7606402
status: test
description: Detects the successful logon of xrdp session
references:
    - https://access.redhat.com/documentation/en-us/red_hat_enterprise_linux/7/html/security_guide/sec-understanding_audit_log_files
    - https://access.redhat.com/articles/4409591#audit-record-types-2
    - https://www.youtube.com/watch?v=VmvY5SQm5-Y&ab_channel=M45C07
author: Adam Liquorish
date: 2024/06/18
modified: 2024/06/18
tags:
    - attack.t1136.001
    - attack.persistence
logsource:
    product: linux
    service: auditd
detection:
    selection_add_user_record_type:
        type: 'USER_CMD' # This is logged without having to configure audit rules on both Ubuntu and Centos
        exe|endswith: 'xrdp-sesman'
        res: 'success'
    condition: 1 of selection_*
falsepositives:
    - Admin activity
level: medium
