title: SSH logon success
id: ec854497-6c26-4c1a-aa79-7b81716b4e9a
status: test
description: Detects successful ssh logon. Such accounts may be used for persistence that do not require persistent remote access tools to be deployed on the system.
references:
    - https://access.redhat.com/documentation/en-us/red_hat_enterprise_linux/7/html/security_guide/sec-understanding_audit_log_files
    - https://access.redhat.com/articles/4409591#audit-record-types-2
    - https://www.youtube.com/watch?v=VmvY5SQm5-Y&ab_channel=M45C07
author: Adam Liquorish
date: 2024/06/18
modified: 2024/06/18
tags:
    - attack.t1136.001
    - attack.persistence
logsource:
    product: linux
    service: auditd
detection:
    selection_add_user_record_type:
        type: 'USER_LOGOUT' # This is logged without having to configure audit rules on both Ubuntu and Centos
        exe|endswith: 'sshd'
        res: 'success'
    condition: 1 of selection_*
falsepositives:
    - Admin activity
level: medium
